%-----------------------------------------------------------   
%         IMPLEMENTAÇÃO NUMÉRICA - DISSERTAÇÃO
%       Universidade Estadual Paulista, FEIS/UNESP

% dinâmica: [M].{a} + [C].{v} + [K].{x} = [M].[I].{aex}

%------------------- MATRIZ DE MASSA -----------------------


function m=massa(N11,N13,N15,N17,N22,N24,N26,N28,p,h,detJ,np)

[P,W]=quadgauss(np);
M11=0;
M12=0;
M13=0;
M14=0;
M15=0;
M16=0;
M17=0;
M18=0;
M21=0;
M22=0;
M23=0;
M24=0;
M25=0;
M26=0;
M27=0;
M28=0;
M31=0;
M32=0;
M33=0;
M34=0;
M35=0;
M36=0;
M37=0;
M38=0;
M41=0;
M42=0;
M43=0;
M44=0;
M45=0;
M46=0;
M47=0;
M48=0;
M51=0;
M52=0;
M53=0;
M54=0;
M55=0;
M56=0;
M57=0;
M58=0;
M61=0;
M62=0;
M63=0;
M64=0;
M65=0;
M66=0;
M67=0;
M68=0;
M71=0;
M72=0;
M73=0;
M74=0;
M75=0;
M76=0;
M77=0;
M78=0;
M81=0;
M82=0;
M83=0;
M84=0;
M85=0;
M86=0;
M87=0;
M88=0;
for n1=1:np,
    for n2=1:np,
        M11=M11+W(n1)*W(n2)*detJ(n1,n2)*(N11(n1,n2)*N11(n1,n2));
        M12=M12+0;
        M13=M13+W(n1)*W(n2)*detJ(n1,n2)*(N13(n1,n2)*N11(n1,n2));
        M14=M14+0;
        M15=M15+W(n1)*W(n2)*detJ(n1,n2)*(N15(n1,n2)*N11(n1,n2));
        M16=M16+0;
        M17=M17+W(n1)*W(n2)*detJ(n1,n2)*(N17(n1,n2)*N11(n1,n2));
        M18=M18+0;
        
        M21=M21+0;
        M22=M22+W(n1)*W(n2)*detJ(n1,n2)*(N22(n1,n2)*N22(n1,n2));
        M23=M23+0;
        M24=M24+W(n1)*W(n2)*detJ(n1,n2)*(N24(n1,n2)*N22(n1,n2));
        M25=M25+0;
        M26=M26+W(n1)*W(n2)*detJ(n1,n2)*(N26(n1,n2)*N22(n1,n2));
        M27=M27+0;
        M28=M28+W(n1)*W(n2)*detJ(n1,n2)*(N28(n1,n2)*N22(n1,n2));
        
        M31=M31+W(n1)*W(n2)*detJ(n1,n2)*(N11(n1,n2)*N13(n1,n2));
        M32=M32+0;
        M33=M33+W(n1)*W(n2)*detJ(n1,n2)*(N13(n1,n2)*N13(n1,n2));
        M34=M34+0;
        M35=M35+W(n1)*W(n2)*detJ(n1,n2)*(N15(n1,n2)*N13(n1,n2));
        M36=M36+0;
        M37=M37+W(n1)*W(n2)*detJ(n1,n2)*(N17(n1,n2)*N13(n1,n2));
        M38=M38+0;
        
        M41=M41+0;
        M42=M42+W(n1)*W(n2)*detJ(n1,n2)*(N22(n1,n2)*N24(n1,n2));
        M43=M43+0;
        M44=M44+W(n1)*W(n2)*detJ(n1,n2)*(N24(n1,n2)*N24(n1,n2));
        M45=M45+0;
        M46=M46+W(n1)*W(n2)*detJ(n1,n2)*(N26(n1,n2)*N24(n1,n2));
        M47=M47+0;
        M48=M48+W(n1)*W(n2)*detJ(n1,n2)*(N28(n1,n2)*N24(n1,n2));
        
        M51=M51+W(n1)*W(n2)*detJ(n1,n2)*(N11(n1,n2)*N15(n1,n2));
        M52=M52+0;
        M53=M53+W(n1)*W(n2)*detJ(n1,n2)*(N13(n1,n2)*N15(n1,n2));
        M54=M54+0;
        M55=M55+W(n1)*W(n2)*detJ(n1,n2)*(N15(n1,n2)*N15(n1,n2));
        M56=M56+0;
        M57=M57+W(n1)*W(n2)*detJ(n1,n2)*(N17(n1,n2)*N15(n1,n2));
        M58=M58+0;
        
        M61=M61+0;
        M62=M62+W(n1)*W(n2)*detJ(n1,n2)*(N22(n1,n2)*N26(n1,n2));
        M63=M63+0;
        M64=M64+W(n1)*W(n2)*detJ(n1,n2)*(N24(n1,n2)*N26(n1,n2));
        M65=M65+0;
        M66=M66+W(n1)*W(n2)*detJ(n1,n2)*(N26(n1,n2)*N26(n1,n2));
        M67=M67+0;
        M68=M68+W(n1)*W(n2)*detJ(n1,n2)*(N28(n1,n2)*N26(n1,n2));
        
        M71=M71+W(n1)*W(n2)*detJ(n1,n2)*(N11(n1,n2)*N17(n1,n2));
        M72=M72+0;
        M73=M73+W(n1)*W(n2)*detJ(n1,n2)*(N13(n1,n2)*N17(n1,n2));
        M74=M74+0;
        M75=M75+W(n1)*W(n2)*detJ(n1,n2)*(N15(n1,n2)*N17(n1,n2));
        M76=M76+0;
        M77=M77+W(n1)*W(n2)*detJ(n1,n2)*(N17(n1,n2)*N17(n1,n2));
        M78=M78+0;
        
        M81=M81+0;
        M82=M82+W(n1)*W(n2)*detJ(n1,n2)*(N22(n1,n2)*N28(n1,n2));
        M83=M83+0;
        M84=M84+W(n1)*W(n2)*detJ(n1,n2)*(N24(n1,n2)*N28(n1,n2));
        M85=M85+0;
        M86=M86+W(n1)*W(n2)*detJ(n1,n2)*(N26(n1,n2)*N28(n1,n2));
        M87=M87+0;
        M88=M88+W(n1)*W(n2)*detJ(n1,n2)*(N28(n1,n2)*N28(n1,n2));
    end
end
m=p*h*[
M11,M12,M13,M14,M15,M16,M17,M18
M21,M22,M23,M24,M25,M26,M27,M28
M31,M32,M33,M34,M35,M36,M37,M38
M41,M42,M43,M44,M45,M46,M47,M48
M51,M52,M53,M54,M55,M56,M57,M58
M61,M62,M63,M64,M65,M66,M67,M68
M71,M72,M73,M74,M75,M76,M77,M78
M81,M82,M83,M84,M85,M86,M87,M88];